In [1]:
import pandas as pd
df=pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [2]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# 1. Find out how many Male and Female passengers were onboarded

In [3]:
df["Sex"].value_counts()

male      577
female    314
Name: Sex, dtype: int64

# 2. How many survived we have

In [4]:
(df["Survived"]==1).value_counts()

False    549
True     342
Name: Survived, dtype: int64

# 3. How many Casualities we have

In [5]:
(df["Survived"]==0).value_counts()

True     549
False    342
Name: Survived, dtype: int64

# 4. What is the name of the person who is the eldest one

In [6]:
df[df["Age"]==max(df["Age"])]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0,A23,S

# 5. How many passengers do we have in First, Second and Third class

In [15]:
df.groupby("Pclass").count()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Pclass,,,,,,,,,,,
1,216,216,216,216,186,216,216,216,216,176,214
2,184,184,184,184,173,184,184,184,184,16,184
3,491,491,491,491,355,491,491,491,491,12,491

# 6. How many persons do we have whose name starts with s

In [16]:
dfnew=df[df["Name"].str[0]=="S"]

In [22]:
dfnew.shape

(86, 12)

# 7. Try to create a column which is sum of SibSp and Parch

In [ ]:
df["New_column"]=df["SibSp"]+df["Parch"]

In [ ]:
df.head()

# 8. How many persons do we have below the age of 25

In [ ]:
(df["Age"]<25).value_counts()

# 9. How many persons died whose age was less than 40

In [ ]:
df3=df[df["Survived"]==0]

In [ ]:
df3.head()

In [ ]:
(df3["Age"]<40).value_counts()

# 10. From Cabin Column seperate text and Numeric values

In [29]:
df_txt=df["Cabin"].str[0]

In [31]:
df_txt.tail()

886    NaN
887      B
888    NaN
889      C
890    NaN
Name: Cabin, dtype: object

In [28]:
df_num=df["Cabin"].str[1:]

In [33]:
df_num.head()

0    NaN
1     85
2    NaN
3    123
4    NaN
Name: Cabin, dtype: object